src/app/shared/mocks/fulfill-dispute-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:Fulfill>
      <con:request>
        <data:AccountCode>123456789</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:AdditionalInputs>
          <data:Data>
            <data:Name>CreditReportVersion</data:Name>
            <data:Value>7.1</data:Value>
          </data:Data>
        </data:AdditionalInputs>
        <data:RequestKey>BC-aaac8c87-faa7-410c-90ae-76ed0666906b</data:RequestKey>
        <data:ClientKey>d7a77bba-f5c6-414b-93e3-78afc90bc7b6</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>105 2ND AV</data:AddressLine1>
            <data:AddressLine2 xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:City>NEWTON</data:City>
            <data:State>IA</data:State>
            <data:Zipcode>50208</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>1971-02-01</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>DANIEL</data:FirstName>
            <data:LastName>ILES</data:LastName>
            <data:MiddleName>J</data:MiddleName>
            <data:Prefix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Suffix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:FullName>
          <data:Ssn>666130041</data:Ssn>
        </data:Customer>
        <data:EnrollmentKey>e62b9e16-dac9-47ff-8fa0-d029b622d59d</data:EnrollmentKey>
        <data:Language xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <data:ServiceBundleCode>CC2BraveCreditTUReport24Hour</data:ServiceBundleCode>
      </con:request>
    </con:Fulfill>
  </soapenv:Body>
</soapenv:Envelope>